Repository: anirudhbhalekar/GF2P2
Catalog: final/locales/*/LC_MESSAGES/logsim_*.po
Languages: el

source: Canvas redrawn on paint event, size is
el: Ο καμβάς επανασχεδιάστηκε στο γεγονός ζωγραφικής, το μέγεθος είναι

source: Monitor Removed
el: Κατάργηση οθόνης

source: Error! Monitor not found!
el: Σφάλμα! Δεν βρέθηκε οθόνη!

source: Monitor Added
el: Προστέθηκε οθόνη

source: Error! Monitor already added!
el: Σφάλμα! Η οθόνη έχει ήδη προστεθεί!

source: Mouse button pressed at:
el: Πάτημα πλήκτρου ποντικιού στη θέση:

source: Mouse button released at:
el: Απελευθέρωση πλήκτρου ποντικιού στη θέση:

source: Mouse left canvas at:
el: Απομάκρυνση ποντικιού από το Canvas στη θέση:

source: Mouse dragged to:
el: Σύρσιμο ποντικιού προς τη θέση:

source: Negative mouse wheel rotation. Zoom is now:
el: Αρνητική περιστροφή τροχού ποντικιού. Η μεγέθυνση είναι τώρα:

source: Positive mouse wheel rotation. Zoom is now:
el: Θετική περιστροφή τροχού ποντικιού. Η μεγέθυνση είναι τώρα:

source: &About
el: &Περί

source: &Exit
el: &Έξοδος

source: &Open
el: &Άνοιγμα

source: &Edit
el: &Επεξεργασία

source: &Commands
el: &Εντολές

source: &Change 3D Signal Max
el: &Αλλαγή Μέγιστης Σήματος 3D

source: &Change 2D Signal Max
el: &Αλλαγή Μέγιστης Σήματος 2D

source: &File
el: &Αρχείο

source: &Source
el: &Πηγή

source: &Command
el: &Εντολή

source: &View Options
el: &Προβολή επιλογών

source: Cycles
el: Κύκλοι

source: Run
el: Εκτέλεση

source: Continue
el: Συνέχεια

source: Reset Plot
el: Επαναφορά Πλοκής

source: Zap Monitor
el: Αποσύνδεση Οθόνης

source: Add Monitor
el: Προσθήκη Οθόνης

source: Reset View
el: Επαναφορά Προβολής

source: Clear terminal
el: Καθαρισμός τερματικού

source: 3D Mode
el: Λειτουργία 3D

source: Clear Terminal
el: Καθαρισμός τερματικού

source: Error! Network oscillating.
el: Σφάλμα! Δίκτυο ανακλαστικό.

source: Nothing to continue - run the simulation first
el: Τίποτα να συνεχίσετε - εκτελέστε πρώτα την προσομοίωση

source: Logic Simulator for GF2P2
el: Προσομοιωτής Λογικής για GF2P2

source: Created by Mojisola Agboola, 2017
el: Δημιουργήθηκε από την Μονζιόλα Αγκμπόλα, 2017

source: Modified by Anirudh Bhalekar, Moses Liew, Shawn Li, 2024
el: Τροποποιήθηκε από τους Ανίρουντ Μπαλέκαρ, Μόσες Λιου, Σον Λι, 2024

source: About Logsim
el: Σχετικά με το Logsim

source: List of user commands: r N - run the simulation for N cycles c N - continue simulation for N cycles s X N - set switch X to N (0 or 1) m X - set a monitor on signal X z X - zap the monitor on signal X h - print a list of available commands on the terminal q - quit the simulation
el: Λίστα εντολών χρήστη: r N - εκτέλεση της προσομοίωσης για N κύκλους c N - συνέχιση της προσομοίωσης για N κύκλους s X N - ρύθμιση του διακόπτη X σε N (0 ή 1) m X - ρύθμιση οθόνης στο σήμα X z X - απενεργοποίηση της οθόνης στο σήμα X h - εκτύπωση μιας λίστας διαθέσιμων εντολών στο τερματικό q - έξοδος από την προσομοίωση

source: Open New Source File
el: Άνοιγμα Νέου Αρχείου Πηγής

source: Opened file:
el: Άνοιξε αρχείο:

source: Error! Faulty definition file!
el: Σφάλμα! Ελαττωματικό αρχείο ορισμού!

source: {num_errors} errors caught
el: {num_errors} σφάλματα που εντοπίστηκαν

source: Cannot open file: {exception}
el: Αδυναμία ανοίγματος αρχείου: {exception}

source: Change Value of 3D max view
el: Αλλαγή τιμής προβολής 3D max

source: Incorrect data type! Not saved
el: Λανθασμένος τύπος δεδομένων! Δεν αποθηκεύτηκε

source: Change Value of 2D max view
el: Αλλαγή τιμής προβολής 2D max

source: New spin control value:
el: Νέα τιμή ελέγχου περιστροφής:

source: Run button pressed, {cycle_count} cycles.
el: Πατήθηκε το κουμπί Εκτέλεση, {cycle_count} κύκλοι.

source: Max cycle count exceeded! Refresh the plot or edit the source data
el: Υπέρβαση μέγιστου αριθμού κύκλων! Ανανεώστε την πλοκή ή επεξεργαστείτε τα δεδομένα πηγής

source: Run failed - cannot plot monitors
el: Η εκτέλεση απέτυχε - δεν είναι δυνατή η παρουσίαση των οθονών

source: Monitor Plots
el: Γραφικές Παραστάσεις Οθονών

source: Reset plot button pressed.
el: Πατήθηκε το κουμπί Επαναφοράς Πλοκής.

source: Continue button pressed, {cycle_count} cycles.
el: Πατήθηκε το κουμπί Συνέχιση, {cycle_count} κύκλοι.

source: Nothing to Continue - try running the simulation first
el: Δεν υπάρχει κάτι να συνεχίσετε - δοκιμάστε πρώτα να εκτελέσετε την προσομοίωση

source: Invalid Device Type
el: Μη έγκυρος Τύπος Συσκευής

source: Monitor addition error
el: Σφάλμα προσθήκης οθόνης

source: Clear button pressed.
el: Πατήθηκε το κουμπί Καθαρισμού.

source: Reset view button pressed
el: Πατήθηκε το κουμπί Επαναφοράς Προβολής

source: Running simulation for {cycles} cycles.
el: Εκτέλεση προσομοίωσης για {cycles} κύκλους.

source: Invalid command. Please provide a valid number of cycles.
el: Μη έγκυρη εντολή. Παρακαλώ δώστε έναν έγκυρο αριθμό κύκλων.

source: Continuing simulation for {cycles} cycles.
el: Συνέχιση της προσομοίωσης για {cycles} κύκλους.

source: Nothing to continue - run the simulation first.
el: Δεν υπάρχει κάτι να συνεχίσετε - εκτελέστε πρώτα την προσομοίωση.

source: Switch value must be 0 or 1
el: Η τιμή του διακόπτη πρέπει να είναι 0 ή 1

source: Switch value must be 0 or 1
el: Η τιμή του διακόπτη πρέπει να είναι 0 ή 1

source: Switch set failed
el: Αποτυχία ρύθμισης διακόπτη

source: Setting switch {switch_name} to {value}.
el: Ρύθμιση διακόπτη {switch_name} σε {value}.

source: Invalid command format. Please provide switch ID and value.
el: Μη έγκυρη μορφή εντολής. Παρακαλώ δώστε ταυτότητα διακόπτη και τιμή.

source: Adding monitor on signal {signal}.
el: Προσθήκη οθόνης στο σήμα {signal}.

source: Monitor addition failed for signal {signal}.
el: Αποτυχία προσθήκης οθόνης για το σήμα {signal}.

source: Zapping monitor on signal {signal}.
el: Απενεργοποίηση οθόνης για το σήμα {signal}.

source: Monitor zap failed for signal {signal}.
el: Αποτυχία απενεργοποίησης οθόνης για το σήμα {signal}.

source: List of available commands: r N - run the simulation for N cycles c N - continue the simulation for N cycles s X N - set switch X to N (0 or 1) m X - add a monitor on signal X z X - zap the monitor on signal X h - print a list of available commands q - quit the program
el: Λίστα διαθέσιμων εντολών: r N - εκτέλεση της προσομοίωσης για N κύκλους c N - συνέχιση της προσομοίωσης για N κύκλους s X N - ρύθμιση του διακόπτη X σε N (0 ή 1) m X - προσθήκη οθόνης στο σήμα X z X - απενεργοποίηση της οθόνης στο σήμα X h - εκτύπωση λίστας διαθέσιμων εντολών q - έξοδος από το πρόγραμμα

source: <{text}> is an invalid command. A list of available commands can be obtained by entering 'h', or navigating to 'Commands' in the Menu.
el: <{text}> είναι μια μη έγκυρη εντολή. Μια λίστα με τις διαθέσιμες εντολές μπορεί να ανακτηθεί πληκτρολογώντας 'h' ή πλοηγούμενοι στο 'Εντολές' στο μενού.

source: Hello world
el: αβγδε

source: Usage: Show help: logsim.py -h Command line user interface: logsim.py -c <file path> Graphical user interface: logsim.py <file path>
el: Χρήση: Εμφάνιση βοήθειας: logsim.py -h Διεπαφή γραμμής εντολών: logsim.py -c <διαδρομή αρχείου> Γραφική διεπαφή χρήστη: logsim.py <διαδρομή αρχείου>

source: Error: invalid command line arguments
el: Σφάλμα: μη έγκυρα ορίσματα γραμμής εντολών

source: Logic Simulator
el: Λογικός Προσομοιωτής

source: Expected num_error_codes to be an integer.
el: Αναμενόταν ο num_error_codes να είναι ακέραιος.

source: Need String argument
el: Χρειάζεται ορισμός συμβολοσειράς

source: Null Strings are not accepted
el: Οι κενές συμβολοσειρές δεν γίνονται δεκτές

source: Name list argument must be a list
el: Η λίστα ονομάτων πρέπει να είναι λίστα

source: Names must be strings
el: Τα ονόματα πρέπει να είναι συμβολοσειρές

source: Name ID must be an integer
el: Το αναγνωριστικό του ονόματος πρέπει να είναι ακέραιος

source: Integer must be greater than or equal to 0
el: Ο αριθμός πρέπει να είναι μεγαλύτερος ή ίσος με το 0

source: Error at line {line_number}, character {character}: {error_message}
el: Κωδικός σφάλματος {error_code} στη γραμμή {line_number}, χαρακτήρας {character}: {error_message}

source: Expected a name
el: Αναμενόταν ένα όνομα

source: CONNECT list must have individual connections delimited by ','
el: Η λίστα CONNECT πρέπει να έχει μεμονωμένες συνδέσεις διαχωρισμένες με ','

source: Semi-colons are required at the end of each line
el: Απαιτούνται ερωτηματικά στο τέλος κάθε γραμμής

source: Invalid keyword, could be missing or misspelled
el: Μη έγκυρη λέξη-κλειδί, ίσως να λείπει ή να έχει κακή ορθογραφία

source: No END statement after MONITOR clause
el: Δεν υπάρχει δήλωση END μετά το τμήμα MONITOR

source: Expected a number
el: Αναμενόταν ένας αριθμός

source: Inputs should be specified - expected a dot
el: Πρέπει να καθοριστούν οι είσοδοι - αναμενόταν μια τελεία

source: Invalid pin reference
el: Μη έγκυρη αναφορά ακίδας

source: Expected an equals sign
el: Αναμενόταν ένα σύμβολο ισοδυναμίας

source: Expected a DEFINE statement first
el: Αναμενόταν μια δήλωση DEFINE

source: Expected a CONNECT statement second
el: Αναμενόταν μια δήλωση CONNECT

source: Expected a MONITOR statement third
el: Αναμενόταν μια δήλωση MONITOR

source: Expected an END statement fourth
el: Αναμενόταν μια δήλωση END

source: Invalid parameter for device
el: Μη έγκυρη αναφορά ακίδας

source: DTYPE device must have 4 inputs
el: Η συσκευή DTYPE πρέπει να έχει 4 εισόδους

source: Passed a keyword when a name was expected
el: Δόθηκε μια λέξη-κλειδί όταν αναμενόταν ένα όνομα

source: Passed a device when a name was expected
el: Δόθηκε μια συσκευή όταν αναμενόταν ένα όνομα

source: Passed a gate when a name was expected
el: Δόθηκε μια πύλη όταν αναμενόταν ένα όνομα

source: No symbols detected, either an empty file or all comments
el: Δεν εντοπίστηκαν σύμβολα, είτε ένα κενό αρχείο είτε μόνο σχόλια

source: Device absent
el: Απουσία συσκευής

source: Input is already connected
el: Η είσοδος είναι ήδη συνδεδεμένη

source: Cannot connect an input to another input
el: Δεν είναι δυνατή η σύνδεση μιας εισόδου σε μια άλλη είσοδο

source: Port absent
el: Απουσία θύρας

source: Cannot connect an output to another output
el: Δεν είναι δυνατή η σύνδεση μιας εξόδου σε μια άλλη έξοδο

source: Device already present
el: Η συσκευή υπάρχει ήδη

source: Qualifier is missing
el: Λείπει ο προσδιορισμός

source: Invalid qualifier
el: Μη έγκυρος προσδιορισμός

source: Qualifier should not be present
el: Δεν πρέπει να υπάρχει προσδιορισμός

source: Invalid device type
el: Μη έγκυρος τύπος συσκευής

source: Device output not found
el: Η έξοδος της συσκευής δεν βρέθηκε

source: Monitor already present
el: Ο ελεγκτής υπάρχει ήδη

source: Unknown error
el: Άγνωστο σφάλμα

source: Total Error Count: {error_count}
el: Συνολικός Αριθμός Σφαλμάτων: {error_count}

source: Syntax Error: {error}
el: Σφάλμα Σύνταξης: {error}

source: Save
el: Αποθήκευση

source: Save File
el: Αποθήκευση Αρχείου

source: Cannot save current data to file.
el: Δεν είναι δυνατή η αποθήκευση των τρέχοντων δεδομένων σε αρχείο.

source: Logic Simulator: interactive command line user interface. Enter 'h' for help.
el: Λογικός Προσομοιωτής: διαδραστική γραμμή εντολών χρήστη. Εισαγωγή 'h' για βοήθεια.

source: Invalid command. Enter 'h' for help.
el: Μη έγκυρη εντολή. Εισαγωγή 'h' για βοήθεια.

source: Error! Expected a name.
el: Σφάλμα! Αναμενόταν ένα όνομα.

source: Error! Unknown name.
el: Σφάλμα! Άγνωστο όνομα.

source: Error! Expected a number.
el: Σφάλμα! Αναμενόταν ένας αριθμός.

source: Number out of range.
el: Ο αριθμός είναι εκτός εύρους.

source: User commands:
el: Εντολές χρήστη:

source: r N - run the simulation for N cycles
el: r N - εκτέλεση της προσομοίωσης για N κύκλους

source: c N - continue the simulation for N cycles
el: c N - συνέχιση της προσομοίωσης για N κύκλους

source: s X N - set switch X to N (0 or 1)
el: s X N - ορισμός του διακόπτη X σε N (0 ή 1)

source: m X - set a monitor on signal X
el: m X - ορισμός ενός ελέγχου στο σήμα X

source: z X - zap the monitor on signal X
el: z X - αποσύνδεση του ελέγχου στο σήμα X

source: h - help (this command)
el: h - βοήθεια (αυτή η εντολή)

source: q - quit the program
el: q - τερματισμός του προγράμματος

source: Successfully set switch.
el: Ο διακόπτης ορίστηκε με επιτυχία.

source: Error! Invalid switch.
el: Σφάλμα! Μη έγκυρος διακόπτης.

source: Successfully made monitor.
el: Ο ελεγκτής δημιουργήθηκε με επιτυχία.

source: Error! Could not make monitor.
el: Σφάλμα! Αδυναμία δημιουργίας ελεγκτή.

source: Successfully zapped monitor
el: Ο ελεγκτής αποσυνδέθηκε με επιτυχία

source: Error! Could not zap monitor.
el: Σφάλμα! Αδυναμία αποσύνδεσης του ελεγκτή.

source: Error! Nothing to continue. Run first.
el: Σφάλμα! Δεν υπάρχει κάτι για συνέχεια. Εκτελέστε πρώτα.
